seasons = ['зима', 'зима', 'весна', 'весна', 'весна', 'лето', 'лето', 'лето', 'осень', 'осень', 'осень', 'зима', ]
month = int(input('Введите месяц числом'))
while month > 12:
    print('Такого месяца нет(1-12)')
    month = int(input('Введите месяц числом'))
else:
    print(seasons[month - 1])

dict_seasons = {1: 'зима', 2: 'весна', 3: 'весна', 4:'весна', 5: 'лето', 6: 'лето', 7: 'лето', 8: 'осень',
                    9: 'осень', 10: 'осень', 11: 'зима', 12: 'зима'}
month = int(input('Введите месяц числом'))
while month > 12:
    print('Такого месяца нет(1-12)')
    month = int(input('Введите месяц числом'))
else:
    print(dict_seasons[month - 1])